[IO_BalanceDef_Circuit InteractiveObjectBalanceDefinition]
DefaultDisplayName="Example of a table"

[IO_BalanceDef_Console InteractiveObjectBalanceDefinition]
DefaultDisplayName="The original Hyperion game"

[IO_Circuit InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[IO_Console InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[M_Anemone_Sirentology MissionDefinition]
MissionName="Sirenology"
MissionDescription="a flower finds an older model in Angel's nuclear control room. [place]Helios has fallen[-place]. Actually, the only thing to do is to delete it. Go to Helios' secret room.."
TurnInDescription="What's better than destroying something for a good cause? there is nothing there. there is nothing there."
MissionSummary="Discover a secret artifact called the Angel Control Core."
MissionGiver="The Googles"
MissionTurnInLocation="Lilith"
TeaserText="Make sure Mermaid Jack's adorable skills don't fall into the wrong hands.."

[M_Anemone_Sirentology:DefeatNewPandorans MissionObjectiveDefinition]
ProgressMessage="Defeat the Neopandorians"

[M_Anemone_Sirentology:DestroyCircuits MissionObjectiveDefinition]
ProgressMessage="Free price"

[M_Anemone_Sirentology:DestroyConsole MissionObjectiveDefinition]
ProgressMessage="Turn off the console."

[M_Anemone_Sirentology:EnterChamber MissionObjectiveDefinition]
ProgressMessage="Enter the room"

[M_Anemone_Sirentology:HackDoor MissionObjectiveDefinition]
ProgressMessage="break the door"

[M_Anemone_Sirentology:KillHyperionBots MissionObjectiveDefinition]
ProgressMessage="Destroy the guardian angel."

[M_Anemone_Sirentology:LeaveChamber MissionObjectiveDefinition]
ProgressMessage="Leave the palace"

[M_Anemone_Sirentology:ReachChamber MissionObjectiveDefinition]
ProgressMessage="Find the secret room"

[M_Anemone_Sirentology:SealTheChamber MissionObjectiveDefinition]
ProgressMessage="Turn off the camera"

[M_Anemone_Sirentology:Set_Ambush MissionObjectiveSetCollectionDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_Sirentology:Set_DefeatNewPandorans MissionObjectiveSetDefinition]
MissionSummaryOverride="Internal cleaning."
MissionDescriptionOverride=""

[M_Anemone_Sirentology:Set_DestroyCircuits MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_Sirentology:Set_DestroyConsole MissionObjectiveSetDefinition]
MissionSummaryOverride="Destroy the camera.."
MissionDescriptionOverride="Lilith receives an old camera from the angel core Helios Control. There's only one thing to do: destroy it. Tanis also wants you to send her information to find the woman in the room. I have two goals."

[M_Anemone_Sirentology:Set_EnterChamber MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_Sirentology:Set_HackDoor MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_Sirentology:Set_KillHyperionBots MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_Sirentology:Set_LeaveChamber MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_Sirentology:Set_ReachChamber MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_Sirentology:Set_SealTheChamber MissionObjectiveSetDefinition]
MissionSummaryOverride="Walk towards the camera."
MissionDescriptionOverride="Lilith opens an ancient control room at the Archangel Helios Core. Breaking it won't stop the angel's suffering and won't hurt anyone. Talk to Lilith."

[M_Anemone_Sirentology:Set_UploadData MissionObjectiveSetDefinition]
MissionSummaryOverride="Sending siren emissions to tennis."
MissionDescriptionOverride=""

[M_Anemone_Sirentology:UploadData MissionObjectiveDefinition]
ProgressMessage="Load tennis data"

